all-posts.org
#+HUGO_BASE_DIR: ./
#+SEQ_TODO: TODO DRAFT DONE

** DONE Javascript notes                             :programming:javascript:
   :PROPERTIES:
   :EXPORT_FILE_NAME: javascript-notes
   :EXPORT_DATE: 2018-06-16
   :END:
   Just some notes on some popular javascript libraries.
*** bootstrap-daterangepicker
**** How to get startDate and endDate
     #+begin_src javascript
     var range = $("#range").daterangepicker();
     var start = range.data("daterangepicker").startDate;
     var end = range.data("daterangepicker").endDate;
     #+end_src

*** lodash
**** map
     #+begin_src javascript
     var data = [{label: '4/1', value: 10}, {label: '4/2', value: 14}];
     var labels = _.map(data, function(item) { return item.label; });
     var values = _.map(data, function(item) { return item.value; });
     #+end_src

     It is especially useful when preparing data for some chart libraries.

**** convert array to object
     #+begin_src javascript
     var data = [{value: 0, name: 'Working'}, {value: 1, name: 'Idle'}];
     var result = _.chain(data).keyBy('value').mapValues('name').value();
     //The result will be {0: 'Working', 1: 'Idle'}
     #+end_src

*** jquery
**** How to pass array when using $.get
     #+begin_src javascript
     $.get("/api", {"name[]": ["George", "Jacky"]}, function(data) {});
     #+end_src

     If you are using Spring MVC for the server side, here is the relative code to receive multiple parameters.
     #+begin_src java
     @GetMapping("/api")
     @ResponseBody
     public YourResponseEntity api(@RequestParam("name") String[] names) {
     //deal with names
     }
     #+end_src

*** es6
**** How to get keys of an object in javascript
   #+begin_src javascript
   const data = {name: "sting", age: 10};
   Object.keys(data);
   #+end_src
